#include <stdio.h>  // Включення заголовочного файлу для введення/виведення.

#define MAX_NRINGS 64  // Визначення макросу для максимальної кількості кілець (64).

int st[4][MAX_NRINGS];  // Масив для представлення 4 "шпиків" і їх кільць.
int nr[4];  // Масив, що зберігає кількість кілець на кожному "шпику".
int nmoves;  // Лічильник кількості переміщень.

void print_st(void) {  // Функція для виводу стану "шпиків".
    for (int i = 1; i <= 3; i++) {
        printf("\n| ");
        for (int j = 0; j < nr[i]; j++) {
            printf("%d ", st[i][j]);
        }
    }
    printf("\n");
}

// Reset
void init(int nrings) {  // Функція для ініціалізації гри з заданою кількістю кілець.
    for (nr[1] = 0; nrings > 0; nr[1]++, nrings--) {//((((((((((((тут замазано
        st[1][nr[1]] = nrings;
    }
    nr[2] = nr[3] = 0;
    nmoves = 0;
    print_st();  // Вивід початкового стану "шпиків".
}

void movel(int n1, int n2) {  // Функція для переміщення кільця з одного "шпику" на інший.
    st[n2][nr[n2]++] = st[n1][nr[n1]--];//(((((((((((замазано
    print_st();  // Вивід оновленого стану "шпиків".
    nmoves++;  // Збільшення лічильника переміщень.
}

void hanoi(int nrings, int i1, int i2, int i3) {  // Рекурсивна функція для вирішення гри "Ханойська вежа".
    if (nrings == 1) {
        movel(i1, i3);  //))))))))замазано
    } else {
        hanoi(nrings - 1, i1, i3, i2);  // ))))))))Рекурсивний виклик для переміщення n-1 кілець з одного "шпику" на інший.
        movel(i1, i3);  //))))))))))) Переміщення одного кільця з одного "шпику" на інший.
        hanoi(nrings - 1, i2, i1, i3);  //)))))))))) Рекурсивний виклик для переміщення n-1 кілець з іншого "шпику" на третій "шпик".
    }
}

int main() {  // Головна функція програми.
    int nrings;
    printf("Rings number: ");
    scanf("%d", &nrings);  // Введення кількості кілець від користувача.
    hanoi(nrings, 1, 2, 3);  // Виклик функції для вирішення гри "Ханойська вежа".
    printf("All rings were moved.\n");  // Вивід повідомлення про завершення гри.
    printf("Moves: %d.\n", nmoves);  // Вивід кількості переміщень.
    return 0;
}

 